/**
 剑指 Offer 10- I. 斐波那契数列
 写一个函数，输入 n ，求斐波那契（Fibonacci）数列的第 n 项（即 F(N)）。斐波那契数列的定义如下：

 F(0) = 0,   F(1) = 1
 F(N) = F(N - 1) + F(N - 2), 其中 N > 1.
 斐波那契数列由 0 和 1 开始，之后的斐波那契数就是由之前的两数相加而得出。

 答案需要取模 1e9+7（1000000007），如计算初始结果为：1000000008，请返回 1。

 示例 1：

 输入：n = 2
 输出：1
 示例 2：

 输入：n = 5
 输出：5

 提示：

 0 <= n <= 100
 */

/**
 F(0) = 0
 F(1) = 1
 F(2) = F(0) + F(1) = 1
 F(3) = F(1) + F(2) = 2
 F(4) = F(3) + F(2) = 3
 F(5) = F(4) + F(3) = 5
 */

func fib(_ n: Int) -> Int {
    if n <= 1 { return n }
    var f_n_1 = 1
    var f_n_2 = 0
    var f_n = 0
    for _ in 0 ..< (n - 1) {
        f_n = (f_n_1 + f_n_2) % 1_000_000_007
        f_n_2 = f_n_1
        f_n_1 = f_n
    }
    return f_n
}

print(fib(5))
